turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8C.atdf
        <module name="CHIPID" version="1.0.0">
          <instance name="CHIPID">
            <register-group name="CHIPID" name-in-module="CHIPID" address-space="base" offset="0x400E0400"/>
            <parameters>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
        </module>
        <module name="CRCCU" id="I7644" version="2.0.2">
          <instance name="CRCCU">
            <register-group name="CRCCU" name-in-module="CRCCU" address-space="base" offset="0x400A4000"/>
            <parameters>
              <param name="INSTANCE_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="DACC" id="I7645" version="1.1.1">
          <instance name="DACC">
            <register-group name="DACC" name-in-module="DACC" address-space="base" offset="0x4003C000"/>
            <signals>
              <signal group="EXT_TRIG" index="0" function="E" pad="PB04"/>
              <signal group="VOUT" function="A" pad="PA06"/>
            </signals>
            <parameters>
              <param name="DACC_EXT_TRIG_MSB" value="0"/>
              <param name="DAC_RES_MSB" value="9"/>
              <param name="PDCA_ID_TX" value="35"/>
              <param name="INSTANCE_ID" value="13"/>
            </parameters>
          </instance>
        </module>
        <module name="EDP" id="I8320" version="1.0.0">
          <instance name="EDP">
            <signals>
              <signal group="TCK" function="default" pad="TCK"/>
              <signal group="TDI" function="Jtag_Alt" pad="PA24"/>
              <signal group="TDO" function="Jtag_Alt" pad="PA23"/>
              <signal group="TMS" function="Jtag_Alt" pad="PA03"/>
            </signals>
          </instance>
        </module>
        <module name="EIC" id="I7529" version="3.0.2">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x400F1000"/>
            <signals>
              <signal group="EXTINT" index="0" function="C" pad="PB01"/>
              <signal group="EXTINT" index="1" function="C" pad="PA06"/>
              <signal group="EXTINT" index="1" function="C" pad="PA16"/>
              <signal group="EXTINT" index="1" function="B" pad="PC24"/>
              <signal group="EXTINT" index="2" function="C" pad="PA04"/>
              <signal group="EXTINT" index="2" function="C" pad="PA17"/>
              <signal group="EXTINT" index="2" function="B" pad="PC25"/>
              <signal group="EXTINT" index="3" function="C" pad="PA05"/>
              <signal group="EXTINT" index="3" function="C" pad="PA18"/>
              <signal group="EXTINT" index="3" function="B" pad="PC26"/>
              <signal group="EXTINT" index="4" function="C" pad="PA07"/>
              <signal group="EXTINT" index="4" function="C" pad="PA19"/>
              <signal group="EXTINT" index="4" function="B" pad="PC27"/>
              <signal group="EXTINT" index="5" function="C" pad="PA20"/>
              <signal group="EXTINT" index="5" function="B" pad="PC03"/>
              <signal group="EXTINT" index="6" function="C" pad="PA21"/>
              <signal group="EXTINT" index="6" function="B" pad="PC04"/>
              <signal group="EXTINT" index="7" function="C" pad="PA22"/>
              <signal group="EXTINT" index="7" function="B" pad="PC05"/>
              <signal group="EXTINT" index="8" function="C" pad="PA23"/>
              <signal group="EXTINT" index="8" function="B" pad="PC06"/>
            </signals>
            <parameters>
              <param name="STD_NUM" value="8"/>
              <param name="EIC_EDGE_IRQ" value="0"/>
              <param name="EIC_FALLING_EDGE" value="0"/>
              <param name="EIC_FILTER_OFF" value="0"/>
              <param name="EIC_FILTER_ON" value="1"/>
              <param name="EIC_HIGH_LEVEL" value="1"/>
              <param name="EIC_LEVEL_IRQ" value="1"/>
              <param name="EIC_LOW_LEVEL" value="0"/>
              <param name="EIC_RISING_EDGE" value="1"/>
              <param name="EIC_SYNC" value="0"/>
              <param name="EIC_USE_ASYNC" value="1"/>
              <param name="INSTANCE_ID" value="100"/>
            </parameters>
          </instance>
        </module>
        <module name="FLASHCALW" id="I8322" version="1.1.0">
          <instance name="HFLASHC">
            <register-group name="HFLASHC" name-in-module="FLASHCALW" address-space="base" offset="0x400A0000"/>
            <signals>
              <signal group="VMARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES" value="1024"/>
              <param name="PAGES_PR_REGION" value="64"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="32"/>
            <param name="IC9692" value="true"/></parameters>
          </instance>
        </module>
        <module name="FUSES" id="I8322" version="1.1.0">
          <instance name="FUSES">
            <register-group address-space="base" offset="0x00800000" name-in-module="USERPAGE_FUSES" name="USERPAGE_FUSES"/>
            <register-group address-space="fuses" offset="0x400A0000" name-in-module="FLASH_FUSES" name="FLASH_FUSES"/>
