turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8C.atdf
        <register name="CPUMASK" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000001" caption="CPU Mask">
          <bitfield name="OCD" caption="OCD CPU Clock Mask" mask="0x1"/>
        </register>
        <register name="HSBMASK" offset="0x24" rw="RW" size="4" access-size="4" initval="0x000001E2" caption="HSB Mask">
          <bitfield name="PDCA_" caption="PDCA HSB Clock Mask" mask="0x1"/>
          <bitfield name="HFLASHC_" caption="HFLASHC HSB Clock Mask" mask="0x2"/>
          <bitfield name="HRAMC1_" caption="HRAMC1 HSB Clock Mask" mask="0x4"/>
          <bitfield name="USBC_" caption="USBC HSB Clock Mask" mask="0x8"/>
          <bitfield name="CRCCU_" caption="CRCCU HSB Clock Mask" mask="0x10"/>
          <bitfield name="HTOP0_" caption="HTOP0 HSB Clock Mask" mask="0x20"/>
          <bitfield name="HTOP1_" caption="HTOP1 HSB Clock Mask" mask="0x40"/>
          <bitfield name="HTOP2_" caption="HTOP2 HSB Clock Mask" mask="0x80"/>
          <bitfield name="HTOP3_" caption="HTOP3 HSB Clock Mask" mask="0x100"/>
          <bitfield name="AESA_" caption="AESA HSB Clock Mask" mask="0x200"/>
        </register>
        <register name="PBAMASK" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="PBA Mask">
          <bitfield name="IISC_" caption="IISC APB Clock Enable" mask="0x1"/>
          <bitfield name="SPI_" caption="SPI APB Clock Enable" mask="0x2"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x4"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x8"/>
          <bitfield name="TWIM0_" caption="TWIM0 APB Clock Enable" mask="0x10"/>
          <bitfield name="TWIS0_" caption="TWIS0 APB Clock Enable" mask="0x20"/>
          <bitfield name="TWIM1_" caption="TWIM1 APB Clock Enable" mask="0x40"/>
          <bitfield name="TWIS1_" caption="TWIS1 APB Clock Enable" mask="0x80"/>
          <bitfield name="USART0_" caption="USART0 APB Clock Enable" mask="0x100"/>
          <bitfield name="USART1_" caption="USART1 APB Clock Enable" mask="0x200"/>
          <bitfield name="USART2_" caption="USART2 APB Clock Enable" mask="0x400"/>
          <bitfield name="USART3_" caption="USART3 APB Clock Enable" mask="0x800"/>
          <bitfield name="ADCIFE_" caption="ADCIFE APB Clock Enable" mask="0x1000"/>
          <bitfield name="DACC_" caption="DACC APB Clock Enable" mask="0x2000"/>
          <bitfield name="ACIFC_" caption="ACIFC APB Clock Enable" mask="0x4000"/>
          <bitfield name="GLOC_" caption="GLOC APB Clock Enable" mask="0x8000"/>
          <bitfield name="ABDACB_" caption="ABDACB APB Clock Enable" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x20000"/>
          <bitfield name="PARC_" caption="PARC APB Clock Enable" mask="0x40000"/>
          <bitfield name="CATB_" caption="CATB APB Clock Enable" mask="0x80000"/>
          <bitfield name="TWIM2_" caption="TWIM2 APB Clock Enable" mask="0x200000"/>
          <bitfield name="TWIM3_" caption="TWIM3 APB Clock Enable" mask="0x400000"/>
          <bitfield name="LCDCA_" caption="LCDCA APB Clock Enable" mask="0x800000"/>
        </register>
        <register name="PBBMASK" offset="0x2C" rw="RW" size="4" access-size="4" initval="0x00000001" caption="PBB Mask">
          <bitfield name="HFLASHC_" caption="HFLASHC APB Clock Enable" mask="0x1"/>
          <bitfield name="HCACHE_" caption="HCACHE APB Clock Enable" mask="0x2"/>
          <bitfield name="HMATRIX_" caption="HMATRIX APB Clock Enable" mask="0x4"/>
          <bitfield name="PDCA_" caption="PDCA APB Clock Enable" mask="0x8"/>
          <bitfield name="CRCCU_" caption="CRCCU APB Clock Enable" mask="0x10"/>
          <bitfield name="USBC_" caption="USBC APB Clock Enable" mask="0x20"/>
          <bitfield name="PEVC_" caption="PEVC APB Clock Enable" mask="0x40"/>
        </register>
        <register name="PBCMASK" offset="0x30" rw="RW" size="4" access-size="4" initval="0x0000001F" caption="PBC Mask">
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x1"/>
          <bitfield name="CHIPID_" caption="CHIPID APB Clock Enable" mask="0x2"/>
          <bitfield name="SCIF_" caption="SCIF APB Clock Enable" mask="0x4"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x8"/>
          <bitfield name="GPIO_" caption="GPIO APB Clock Enable" mask="0x10"/>
        </register>
        <register name="PBDMASK" offset="0x34" rw="RW" size="4" access-size="4" initval="0x0000003F" caption="PBD Mask">
          <bitfield name="BPM_" caption="BPM APB Clock Enable" mask="0x1"/>
          <bitfield name="BSCIF_" caption="BSCIF APB Clock Enable" mask="0x2"/>
          <bitfield name="AST_" caption="AST APB Clock Enable" mask="0x4"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x8"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x10"/>
          <bitfield name="PICOUART_" caption="PICOUART APB Clock Enable" mask="0x20"/>
        </register>
        <register name="PBADIVMASK" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="PBA Divided Clock Mask">
        </register>
        <register name="CFDCTRL" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detection Enable" mask="0x1"/>
          <bitfield name="SFV" caption="Store Final Value" mask="0x80000000"/>
        </register>
        <register name="UNLOCK" offset="0x58" rw="W" size="4" access-size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000"/>
        </register>
        <register name="IER" offset="0xC0" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Enable" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Enable" mask="0x100" values="PM_IER__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0xC4" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Disable" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Disable" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Disable" mask="0x100" values="PM_IDR__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Disable" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0xC8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Mask" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Mask" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Mask" mask="0x100" values="PM_IMR__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Mask" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Status" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Status" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Status" mask="0x100" values="PM_ISR__WAKE"/>
          <bitfield name="AE" caption="Access Error Interrupt Status" mask="0x80000000"/>
        </register>
        <register name="ICR" offset="0xD0" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="CFD" caption="Clock Failure Detected Interrupt Status Clear" mask="0x1"/>
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Status Clear" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up Interrupt Status Clear" mask="0x100"/>
          <bitfield name="AE" caption="Access Error Interrupt Status Clear" mask="0x80000000"/>
        </register>
