turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8C.atdf
        <register name="SR" offset="0xD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="CFD" caption="Clock Failure Detected" mask="0x1"/>
          <bitfield name="OCP" caption="Over Clock Detected" mask="0x2"/>
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x20"/>
          <bitfield name="WAKE" caption="Wake up" mask="0x100" values="PM_SR__WAKE"/>
          <bitfield name="PERRDY" caption="Peripheral Ready" mask="0x10000000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="PPCR" offset="0x160" rw="RW" size="4" access-size="4" initval="0x000001FE" caption="Peripheral Power Control Register">
          <bitfield name="RSTPUN" caption="Reset Pullup" mask="0x1"/>
          <bitfield name="CATBRCMASK" caption="CAT Request Clock Mask" mask="0x2"/>
          <bitfield name="ACIFCRCMASK" caption="ACIFC Request Clock Mask" mask="0x4"/>
          <bitfield name="ASTRCMASK" caption="AST Request Clock Mask" mask="0x8"/>
          <bitfield name="TWIS0RCMASK" caption="TWIS0 Request Clock Mask" mask="0x10"/>
          <bitfield name="TWIS1RCMASK" caption="TWIS1 Request Clock Mask" mask="0x20"/>
          <bitfield name="PEVCRCMASK" caption="PEVC Request Clock Mask" mask="0x40"/>
          <bitfield name="ADCIFERCMASK" caption="ADCIFE Request Clock Mask" mask="0x80"/>
          <bitfield name="VREGRCMASK" caption="VREG Request Clock Mask" mask="0x100"/>
          <bitfield name="FWBGREF" caption="Flash Wait BGREF" mask="0x200"/>
          <bitfield name="FWBOD18" caption="Flash Wait BOD18" mask="0x400"/>
        </register>
        <register name="RCAUSE" offset="0x180" rw="R" size="4" access-size="4" initval="0x00000000" caption="Reset Cause Register">
          <bitfield name="POR" caption="Power-on Reset" mask="0x1"/>
          <bitfield name="BOD" caption="Brown-out Reset" mask="0x2"/>
          <bitfield name="EXT" caption="External Reset Pin" mask="0x4"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x8"/>
          <bitfield name="OCDRST" caption="OCD Reset" mask="0x100"/>
          <bitfield name="POR33" caption="Power-on Reset" mask="0x400"/>
          <bitfield name="BOD33" caption="Brown-out 3.3V Reset" mask="0x2000"/>
        </register>
        <register name="WCAUSE" offset="0x184" rw="R" size="4" access-size="4" initval="0x00000000" caption="Wake Cause Register">
          <bitfield name="TWI_SLAVE_0" caption="Two-wire Slave Interface 0" mask="0x1"/>
          <bitfield name="TWI_SLAVE_1" caption="Two-wire Slave Interface 1" mask="0x2"/>
          <bitfield name="USBC" caption="USB Device and Embedded Host Interface" mask="0x4"/>
          <bitfield name="PSOK" caption="Power Scaling OK" mask="0x8"/>
          <bitfield name="BOD18_IRQ" caption="BOD18 Interrupt" mask="0x10"/>
          <bitfield name="BOD33_IRQ" caption="BOD33 Interrupt" mask="0x20"/>
          <bitfield name="PICOUART" caption="Picopower UART" mask="0x40"/>
          <bitfield name="LCDCA" caption="LCD Controller" mask="0x80"/>
          <bitfield name="EIC" caption="External Interrupt Controller" mask="0x10000"/>
          <bitfield name="AST" caption="Asynchronous Timer" mask="0x20000"/>
        </register>
        <register name="AWEN" offset="0x188" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Asynchronous Wake Enable">
          <bitfield name="AWEN" caption="Asynchronous Wake Up" mask="0xFFFFFFFF"/>
        </register>
        <register name="OBS" offset="0x190" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Obsvervability">
        </register>
        <register name="FASTSLEEP" offset="0x194" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fast Sleep Register">
          <bitfield name="OSC" caption="Oscillator" mask="0x1"/>
          <bitfield name="PLL" caption="PLL" mask="0x100"/>
          <bitfield name="FASTRCOSC" caption="RC80 or FLO" mask="0x1F0000"/>
          <bitfield name="DFLL" caption="DFLL" mask="0x1000000"/>
        </register>
        <register name="CONFIG" offset="0x3F8" rw="R" size="4" access-size="4" initval="0x0000000F" caption="Configuration Register">
          <bitfield name="PBA" caption="APBA Implemented" mask="0x1"/>
          <bitfield name="PBB" caption="APBB Implemented" mask="0x2"/>
          <bitfield name="PBC" caption="APBC Implemented" mask="0x4"/>
          <bitfield name="PBD" caption="APBD Implemented" mask="0x8"/>
          <bitfield name="HSBPEVC" caption="HSB PEVC Clock Implemented" mask="0x80"/>
        </register>
        <register name="VERSION" offset="0x3FC" rw="R" size="4" access-size="4" initval="0x00000441" caption="Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="PM_CPUSEL__CPUSEL">
        <value name="0" caption="FCPU:fmain. CPUDIV:" value="0"/>
        <value name="1" caption="FCPU:fmain / 2^(CPUSEL+1)" value="1"/>
      </value-group>
      <value-group name="PM_IER__WAKE">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="PM_IDR__WAKE">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="PM_IMR__WAKE">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="PM_ISR__WAKE">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="PM_SR__WAKE">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
    </module>
