turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8C.atdf
    <module name="SCIF" id="I7149" version="1.3.0" caption="System Control Interface">
      <register-group name="SCIF" caption="System Control Interface">
        <register name="IER" offset="0x0" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0x4" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="ICR" offset="0x10" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="PCLKSR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Power and Clocks Status Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Locked on Coarse Value" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Locked on Fine Value" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Synchronization Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Track Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Locked on Accurate value" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 lock lost value" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Locked on Accurate value" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST lock lost value" mask="0x4000"/>
        </register>
        <register name="UNLOCK" offset="0x18" rw="W" size="4" access-size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000"/>
        </register>
