turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8C.atdf
        <register name="IMR" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RXRDY" caption="RX Buffer Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="TX Buffer Ready" mask="0x2"/>
          <bitfield name="TCOMP" caption="Transmission Complete" mask="0x8"/>
          <bitfield name="URUN" caption="Underrun" mask="0x40"/>
          <bitfield name="ORUN" caption="Overrun" mask="0x80"/>
          <bitfield name="NAK" caption="NAK Received" mask="0x100"/>
          <bitfield name="SMBTOUT" caption="SMBus Timeout" mask="0x1000"/>
          <bitfield name="SMBPECERR" caption="SMBus PEC Error" mask="0x2000"/>
          <bitfield name="BUSERR" caption="Bus Error" mask="0x4000"/>
          <bitfield name="SAM" caption="Slave Address Match" mask="0x10000"/>
          <bitfield name="GCM" caption="General Call Match" mask="0x20000"/>
          <bitfield name="SMBALERTM" caption="SMBus Alert Response Address Match" mask="0x40000"/>
          <bitfield name="SMBHHM" caption="SMBus Host Header Address Match" mask="0x80000"/>
          <bitfield name="SMBDAM" caption="SMBus Default Address Match" mask="0x100000"/>
          <bitfield name="STO" caption="Stop Received" mask="0x200000"/>
          <bitfield name="REP" caption="Repeated Start Received" mask="0x400000"/>
          <bitfield name="BTF" caption="Byte Transfer Finished" mask="0x800000"/>
        </register>
        <register name="SCR" offset="0x28" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="TCOMP" caption="Transmission Complete" mask="0x8"/>
          <bitfield name="URUN" caption="Underrun" mask="0x40"/>
          <bitfield name="ORUN" caption="Overrun" mask="0x80"/>
          <bitfield name="NAK" caption="NAK Received" mask="0x100"/>
          <bitfield name="SMBTOUT" caption="SMBus Timeout" mask="0x1000"/>
          <bitfield name="SMBPECERR" caption="SMBus PEC Error" mask="0x2000"/>
          <bitfield name="BUSERR" caption="Bus Error" mask="0x4000"/>
          <bitfield name="SAM" caption="Slave Address Match" mask="0x10000"/>
          <bitfield name="GCM" caption="General Call Match" mask="0x20000"/>
          <bitfield name="SMBALERTM" caption="SMBus Alert Response Address Match" mask="0x40000"/>
          <bitfield name="SMBHHM" caption="SMBus Host Header Address Match" mask="0x80000"/>
          <bitfield name="SMBDAM" caption="SMBus Default Address Match" mask="0x100000"/>
          <bitfield name="STO" caption="Stop Received" mask="0x200000"/>
          <bitfield name="REP" caption="Repeated Start Received" mask="0x400000"/>
          <bitfield name="BTF" caption="Byte Transfer Finished" mask="0x800000"/>
        </register>
        <register name="PR" offset="0x2C" rw="R" size="4" access-size="4" initval="0x00000001" caption="Parameter Register">
          <bitfield name="HS" caption="HS-mode" mask="0x1"/>
        </register>
        <register name="VR" offset="0x30" rw="R" size="4" access-size="4" initval="0x00000140" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="HSTR" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="HS-mode Timing Register">
          <bitfield name="HDDAT" caption="Data Hold Cycles" mask="0xFF0000"/>
        </register>
        <register name="SRR" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Slew Rate Register">
          <bitfield name="DADRIVEL" caption="Data Drive Strength LOW" mask="0x7"/>
          <bitfield name="DASLEW" caption="Data Slew Limit" mask="0x300"/>
          <bitfield name="FILTER" caption="Input Spike Filter Control" mask="0x30000000"/>
        </register>
        <register name="HSSRR" offset="0x3C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="HS-mode Slew Rate Register">
          <bitfield name="DADRIVEL" caption="Data Drive Strength LOW" mask="0x7"/>
          <bitfield name="DASLEW" caption="Data Slew Limit" mask="0x300"/>
          <bitfield name="FILTER" caption="Input Spike Filter Control" mask="0x30000000"/>
        </register>
      </register-group>
    </module>
    <module name="USART" id="I7601" version="6.0.2.1" caption="Universal Synchronous Asynchronous Receiver Transmitter">
      <register-group name="USART" caption="Universal Synchronous Asynchronous Receiver Transmitter">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" caption="Control Register">
          <mode name="LIN_MODE">
            <bitfield name="RSTRX" caption="Reset Receiver" mask="0x4" values="USART_CR__RSTRX"/>
            <bitfield name="RSTTX" caption="Reset Transmitter" mask="0x8" values="USART_CR__RSTTX"/>
            <bitfield name="RXEN" caption="Receiver Enable" mask="0x10" values="USART_CR__RXEN"/>
            <bitfield name="RXDIS" caption="Receiver Disable" mask="0x20" values="USART_CR__RXDIS"/>
            <bitfield name="TXEN" caption="Transmitter Enable" mask="0x40" values="USART_CR__TXEN"/>
            <bitfield name="TXDIS" caption="Transmitter Disable" mask="0x80" values="USART_CR__TXDIS"/>
            <bitfield name="RSTSTA" caption="Reset Status Bits" mask="0x100" values="USART_CR__RSTSTA"/>
            <bitfield name="STTBRK" caption="Start Break" mask="0x200" values="USART_CR__STTBRK"/>
            <bitfield name="STPBRK" caption="Stop Break" mask="0x400" values="USART_CR__STPBRK"/>
            <bitfield name="STTTO" caption="Start Time-out" mask="0x800" values="USART_CR__STTTO"/>
            <bitfield name="SENDA" caption="Send Address" mask="0x1000" values="USART_CR__SENDA"/>
            <bitfield name="RSTIT" caption="Reset Iterations" mask="0x2000" values="USART_CR__RSTIT"/>
            <bitfield name="RSTNACK" caption="Reset Non Acknowledge" mask="0x4000" values="USART_CR__RSTNACK"/>
            <bitfield name="RETTO" caption="Rearm Time-out" mask="0x8000" values="USART_CR__RETTO"/>
            <bitfield name="DTREN" caption="Data Terminal Ready Enable" mask="0x10000" values="USART_CR__DTREN"/>
            <bitfield name="DTRDIS" caption="Data Terminal Ready Disable" mask="0x20000" values="USART_CR__DTRDIS"/>
            <bitfield name="RTSEN" caption="Request to Send Enable" mask="0x40000" values="USART_CR__RTSEN"/>
            <bitfield name="RTSDIS" caption="Request to Send Disable" mask="0x80000" values="USART_CR__RTSDIS"/>
            <bitfield name="LINABT" caption="Abort the current LIN transmission" mask="0x100000"/>
            <bitfield name="LINWKUP" caption="Sends a wakeup signal on the LIN bus" mask="0x200000"/>
          </mode>
          <mode name="SPI_MASTER_MODE">
            <bitfield name="RSTRX" caption="Reset Receiver" mask="0x4" values="USART_CR__RSTRX"/>
            <bitfield name="RSTTX" caption="Reset Transmitter" mask="0x8" values="USART_CR__RSTTX"/>
            <bitfield name="RXEN" caption="Receiver Enable" mask="0x10" values="USART_CR__RXEN"/>
            <bitfield name="RXDIS" caption="Receiver Disable" mask="0x20" values="USART_CR__RXDIS"/>
            <bitfield name="TXEN" caption="Transmitter Enable" mask="0x40" values="USART_CR__TXEN"/>
            <bitfield name="TXDIS" caption="Transmitter Disable" mask="0x80" values="USART_CR__TXDIS"/>
            <bitfield name="RSTSTA" caption="Reset Status Bits" mask="0x100" values="USART_CR__RSTSTA"/>
            <bitfield name="STTBRK" caption="Start Break" mask="0x200" values="USART_CR__STTBRK"/>
            <bitfield name="STPBRK" caption="Stop Break" mask="0x400" values="USART_CR__STPBRK"/>
            <bitfield name="STTTO" caption="Start Time-out" mask="0x800" values="USART_CR__STTTO"/>
            <bitfield name="SENDA" caption="Send Address" mask="0x1000" values="USART_CR__SENDA"/>
            <bitfield name="RSTIT" caption="Reset Iterations" mask="0x2000" values="USART_CR__RSTIT"/>
            <bitfield name="RSTNACK" caption="Reset Non Acknowledge" mask="0x4000" values="USART_CR__RSTNACK"/>
            <bitfield name="RETTO" caption="Rearm Time-out" mask="0x8000" values="USART_CR__RETTO"/>
            <bitfield name="DTREN" caption="Data Terminal Ready Enable" mask="0x10000" values="USART_CR__DTREN"/>
            <bitfield name="DTRDIS" caption="Data Terminal Ready Disable" mask="0x20000" values="USART_CR__DTRDIS"/>
            <bitfield name="FCS" caption="Force SPI Chip Select" mask="0x40000" values="USART_CR__FCS"/>
            <bitfield name="RCS" caption="Release SPI Chip Select" mask="0x80000" values="USART_CR__RCS"/>
          </mode>
          <mode name="USART_MODE">
            <bitfield name="RSTRX" caption="Reset Receiver" mask="0x4" values="USART_CR__RSTRX"/>
            <bitfield name="RSTTX" caption="Reset Transmitter" mask="0x8" values="USART_CR__RSTTX"/>
            <bitfield name="RXEN" caption="Receiver Enable" mask="0x10" values="USART_CR__RXEN"/>
            <bitfield name="RXDIS" caption="Receiver Disable" mask="0x20" values="USART_CR__RXDIS"/>
            <bitfield name="TXEN" caption="Transmitter Enable" mask="0x40" values="USART_CR__TXEN"/>
            <bitfield name="TXDIS" caption="Transmitter Disable" mask="0x80" values="USART_CR__TXDIS"/>
            <bitfield name="RSTSTA" caption="Reset Status Bits" mask="0x100" values="USART_CR__RSTSTA"/>
            <bitfield name="STTBRK" caption="Start Break" mask="0x200" values="USART_CR__STTBRK"/>
            <bitfield name="STPBRK" caption="Stop Break" mask="0x400" values="USART_CR__STPBRK"/>
            <bitfield name="STTTO" caption="Start Time-out" mask="0x800" values="USART_CR__STTTO"/>
            <bitfield name="SENDA" caption="Send Address" mask="0x1000" values="USART_CR__SENDA"/>
            <bitfield name="RSTIT" caption="Reset Iterations" mask="0x2000" values="USART_CR__RSTIT"/>
            <bitfield name="RSTNACK" caption="Reset Non Acknowledge" mask="0x4000" values="USART_CR__RSTNACK"/>
            <bitfield name="RETTO" caption="Rearm Time-out" mask="0x8000" values="USART_CR__RETTO"/>
            <bitfield name="DTREN" caption="Data Terminal Ready Enable" mask="0x10000" values="USART_CR__DTREN"/>
            <bitfield name="DTRDIS" caption="Data Terminal Ready Disable" mask="0x20000" values="USART_CR__DTRDIS"/>
            <bitfield name="RTSEN" caption="Request to Send Enable" mask="0x40000" values="USART_CR__RTSEN"/>
            <bitfield name="RTSDIS" caption="Request to Send Disable" mask="0x80000" values="USART_CR__RTSDIS"/>
          </mode>
        </register>
        <register name="MR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <mode name="SPI_MODE">
            <bitfield name="MODE" caption="Usart Mode" mask="0xF" values="USART_MR__MODE"/>
            <bitfield name="USCLKS" caption="Clock Selection" mask="0x30" values="USART_MR__USCLKS"/>
            <bitfield name="CHRL" caption="Character Length." mask="0xC0" values="USART_MR__CHRL"/>
            <bitfield name="CPHA" caption="SPI CLock Phase" mask="0x100" values="USART_MR__CPHA"/>
            <bitfield name="PAR" caption="Parity Type" mask="0xE00" values="USART_MR__PAR"/>
            <bitfield name="NBSTOP" caption="Number of Stop Bits" mask="0x3000" values="USART_MR__NBSTOP"/>
            <bitfield name="CHMODE" caption="Channel Mode" mask="0xC000" values="USART_MR__CHMODE"/>
            <bitfield name="CPOL" caption="SPI Clock Polarity" mask="0x10000" values="USART_MR__CPOL"/>
            <bitfield name="MODE9" caption="9-bit Character Length" mask="0x20000" values="USART_MR__MODE9"/>
            <bitfield name="CLKO" caption="Clock Output Select" mask="0x40000" values="USART_MR__CLKO"/>
            <bitfield name="OVER" caption="Oversampling Mode" mask="0x80000" values="USART_MR__OVER"/>
            <bitfield name="INACK" caption="Inhibit Non Acknowledge" mask="0x100000" values="USART_MR__INACK"/>
            <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x200000" values="USART_MR__DSNACK"/>
            <bitfield name="INVDATA" caption="Inverted data" mask="0x800000"/>
            <bitfield name="MAX_ITERATION" caption="Max interation" mask="0x7000000"/>
            <bitfield name="FILTER" caption="Infrared Receive Line Filter" mask="0x10000000" values="USART_MR__FILTER"/>
          </mode>
          <mode name="USART_MODE">
            <bitfield name="MODE" caption="Usart Mode" mask="0xF" values="USART_MR__MODE"/>
            <bitfield name="USCLKS" caption="Clock Selection" mask="0x30" values="USART_MR__USCLKS"/>
            <bitfield name="CHRL" caption="Character Length." mask="0xC0" values="USART_MR__CHRL"/>
            <bitfield name="SYNC" caption="Synchronous Mode Select" mask="0x100" values="USART_MR__SYNC"/>
            <bitfield name="PAR" caption="Parity Type" mask="0xE00" values="USART_MR__PAR"/>
            <bitfield name="NBSTOP" caption="Number of Stop Bits" mask="0x3000" values="USART_MR__NBSTOP"/>
            <bitfield name="CHMODE" caption="Channel Mode" mask="0xC000" values="USART_MR__CHMODE"/>
            <bitfield name="MSBF" caption="Bit Order" mask="0x10000" values="USART_MR__MSBF"/>
            <bitfield name="MODE9" caption="9-bit Character Length" mask="0x20000" values="USART_MR__MODE9"/>
            <bitfield name="CLKO" caption="Clock Output Select" mask="0x40000" values="USART_MR__CLKO"/>
            <bitfield name="OVER" caption="Oversampling Mode" mask="0x80000" values="USART_MR__OVER"/>
            <bitfield name="INACK" caption="Inhibit Non Acknowledge" mask="0x100000" values="USART_MR__INACK"/>
            <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x200000" values="USART_MR__DSNACK"/>
            <bitfield name="VAR_SYNC" caption="Variable synchronization of command/data sync Start Frame Delimiter" mask="0x400000" values="USART_MR__VAR_SYNC"/>
            <bitfield name="INVDATA" caption="Inverted data" mask="0x800000"/>
            <bitfield name="MAX_ITERATION" caption="Max interation" mask="0x7000000"/>
            <bitfield name="FILTER" caption="Infrared Receive Line Filter" mask="0x10000000" values="USART_MR__FILTER"/>
            <bitfield name="MAN" caption="Manchester Encoder/Decoder Enable" mask="0x20000000" values="USART_MR__MAN"/>
            <bitfield name="MODSYNC" caption="Manchester Synchronization Mode" mask="0x40000000" values="USART_MR__MODSYNC"/>
            <bitfield name="ONEBIT" caption="Start Frame Delimiter selector" mask="0x80000000" values="USART_MR__ONEBIT"/>
          </mode>
        </register>
        <register name="IER" offset="0x8" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <mode name="LIN_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready Interrupt Enable" mask="0x1" values="USART_IER__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready Interrupt Enable" mask="0x2" values="USART_IER__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Enable" mask="0x4" values="USART_IER__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Enable" mask="0x20" values="USART_IER__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Enable" mask="0x40" values="USART_IER__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Enable" mask="0x80" values="USART_IER__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Enable" mask="0x100" values="USART_IER__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty Interrupt Enable" mask="0x200" values="USART_IER__TXEMPTY"/>
            <bitfield name="ITER" caption="Iteration Interrupt Enable" mask="0x400" values="USART_IER__ITER"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Enable" mask="0x800" values="USART_IER__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Enable" mask="0x1000" values="USART_IER__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Enable" mask="0x2000" values="USART_IER__NACK"/>
            <bitfield name="LINID" caption="LIN Identifier Sent or LIN Identifier Received Interrupt Enable" mask="0x4000"/>
            <bitfield name="LINTC" caption="LIN Transfer Conpleted Interrupt Enable" mask="0x8000"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Enable" mask="0x10000" values="USART_IER__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Enable" mask="0x20000" values="USART_IER__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Enable" mask="0x40000" values="USART_IER__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Enable" mask="0x80000" values="USART_IER__CTSIC"/>
            <bitfield name="LINBE" caption="LIN Bus Error Interrupt Enable" mask="0x2000000"/>
            <bitfield name="LINISFE" caption="LIN Inconsistent Synch Field Error Interrupt Enable" mask="0x4000000"/>
            <bitfield name="LINIPE" caption="LIN Identifier Parity Interrupt Enable" mask="0x8000000"/>
            <bitfield name="LINCE" caption="LIN Checksum Error Interrupt Enable" mask="0x10000000"/>
            <bitfield name="LINSNRE" caption="LIN Slave Not Responding Error Interrupt Enable" mask="0x20000000"/>
            <bitfield name="LINSTE" caption="LIN Synch Tolerance Error Interrupt Enable" mask="0x40000000" values="USART_IER__LINSTE"/>
            <bitfield name="LINHTE" caption="LIN Header Timeout Error Interrupt Enable" mask="0x80000000" values="USART_IER__LINHTE"/>
          </mode>
          <mode name="SPI_SLAVE_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready Interrupt Enable" mask="0x1" values="USART_IER__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready Interrupt Enable" mask="0x2" values="USART_IER__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Enable" mask="0x4" values="USART_IER__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Enable" mask="0x20" values="USART_IER__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Enable" mask="0x40" values="USART_IER__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Enable" mask="0x80" values="USART_IER__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Enable" mask="0x100" values="USART_IER__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty Interrupt Enable" mask="0x200" values="USART_IER__TXEMPTY"/>
            <bitfield name="UNRE" caption="SPI Underrun Error Interrupt Enable" mask="0x400" values="USART_IER__UNRE"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Enable" mask="0x800" values="USART_IER__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Enable" mask="0x1000" values="USART_IER__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge Interrupt Enable" mask="0x2000" values="USART_IER__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Enable" mask="0x10000" values="USART_IER__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Enable" mask="0x20000" values="USART_IER__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Enable" mask="0x40000" values="USART_IER__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Enable" mask="0x80000" values="USART_IER__CTSIC"/>
          </mode>
          <mode name="USART_MODE">
            <bitfield name="RXRDY" caption="Receiver Ready Interrupt Enable" mask="0x1" values="USART_IER__RXRDY"/>
            <bitfield name="TXRDY" caption="Transmitter Ready Interrupt Enable" mask="0x2" values="USART_IER__TXRDY"/>
            <bitfield name="RXBRK" caption="Receiver Break Interrupt Enable" mask="0x4" values="USART_IER__RXBRK"/>
            <bitfield name="OVRE" caption="Overrun Error Interrupt Enable" mask="0x20" values="USART_IER__OVRE"/>
            <bitfield name="FRAME" caption="Framing Error Interrupt Enable" mask="0x40" values="USART_IER__FRAME"/>
            <bitfield name="PARE" caption="Parity Error Interrupt Enable" mask="0x80" values="USART_IER__PARE"/>
            <bitfield name="TIMEOUT" caption="Time-out Interrupt Enable" mask="0x100" values="USART_IER__TIMEOUT"/>
            <bitfield name="TXEMPTY" caption="Transmitter Empty Interrupt Enable" mask="0x200" values="USART_IER__TXEMPTY"/>
            <bitfield name="ITER" caption="Iteration Interrupt Enable" mask="0x400" values="USART_IER__ITER"/>
            <bitfield name="TXBUFE" caption="Buffer Empty Interrupt Enable" mask="0x800" values="USART_IER__TXBUFE"/>
            <bitfield name="RXBUFF" caption="Buffer Full Interrupt Enable" mask="0x1000" values="USART_IER__RXBUFF"/>
            <bitfield name="NACK" caption="Non Acknowledge Interrupt Enable" mask="0x2000" values="USART_IER__NACK"/>
            <bitfield name="RIIC" caption="Ring Indicator Input Change Enable" mask="0x10000" values="USART_IER__RIIC"/>
            <bitfield name="DSRIC" caption="Data Set Ready Input Change Enable" mask="0x20000" values="USART_IER__DSRIC"/>
            <bitfield name="DCDIC" caption="Data Carrier Detect Input Change Interrupt Enable" mask="0x40000" values="USART_IER__DCDIC"/>
            <bitfield name="CTSIC" caption="Clear to Send Input Change Interrupt Enable" mask="0x80000" values="USART_IER__CTSIC"/>
            <bitfield name="MANE" caption="Manchester Error Interrupt Enable" mask="0x100000"/>
            <bitfield name="MANEA" caption="Manchester Error Interrupt Enable" mask="0x1000000" values="USART_IER__MANEA"/>
          </mode>
        </register>
